TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
    while (UCB0CTLW0 & UCTXSTT);                 // wait for start bit to clear
    UCB0CTLW0 |= UCTXSTP; // generate stop condition
    while (UCB0CTLW0 & UCTXSTP); // wait for stop to finish

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read the status + data
    UCB0CTLW0 &= ~UCTR;   // receiver mode
    UCB0CTLW0 |= UCTXSTT; // start condition

    // read status byte
    while (!(UCB0IFG & UCTXIFG)); // wait until interrupt
    statusByte = UCB0RXBUF;

    // check for an error
    if (statusByte != SFE_BIO_SUCCESS)
    {
        UCB0CTLW0 |= UCTXSTP;
        return statusByte;
    }

    for (size_t i = 0; i < _len; i++)
    {
        if (i == (_len - 1))
        {
            UCB0CTLW0 |= UCTXSTP; // stop before last byte
        }
        while (!(UCB0IFG & UCRXIFG))
            ;
        userArray[i] = UCB0RXBUF;
    }

    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::readMultipleBytes(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, const size_t _len, int32_t userArray[])
{
    uint8_t statusByte = 0xFF;

    // write the three bytes
    UCB0I2CSA = this->_address;
    UCB0CTLW0 = UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _writeByte;

    while (UCB0CTLW0 & UCTXSTT);                 // wait for start bit to clear
    UCB0CTLW0 |= UCTXSTP; // generate stop condition
    while (UCB0CTLW0 & UCTXSTP); // wait for stop to finish

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read the status + data
    UCB0CTLW0 &= ~UCTR;   // receiver mode
    UCB0CTLW0 |= UCTXSTT; // start condition

    // read status byte
    while (!(UCB0IFG & UCTXIFG)); // wait until interrupt
    statusByte = UCB0RXBUF;

    // check for an error
    if (statusByte != SFE_BIO_SUCCESS)
    {
        UCB0CTLW0 |= UCTXSTP;
        return statusByte;
    }

    // each 32-bit int is sent as 4 bytes big-endian
    for (size_t i = 0; i < _len; i++)
    {
        userArray[i] = 0;
        for (uint8_t j = 0; j < 4; j++)
        {
            // check if its the last byte
            if (i == (_len - 1) && j == 3)
            {
                UCB0CTLW0 |= UCTXSTP;
            }
            while (!(UCB0IFG & UCRXIFG));
            userArray[i] = (userArray[i] << 8) | UCB0RXBUF;
        }
    }

    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::readFillArray(uint8_t _familyByte, uint8_t _indexByte, uint8_t arraySize, uint8_t array[])
{

    // write request
    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;
    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;
    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;
    while (UCB0CTLW0 & UCTXSTT);
    UCB0CTLW0 |= UCTXSTP;
    while (UCB0CTLW0 & UCTXSTP);

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read response
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    while (!(UCB0IFG & UCRXIFG));
    uint8_t statusByte = UCB0RXBUF; // first byte is always status

    if (statusByte != SFE_BIO_SUCCESS)
    {
        UCB0CTLW0 |= UCTXSTP;
        return statusByte;
    }

    for (uint8_t i = 0; i < arraySize; i++)
    {
        if (i == (arraySize - 1))
        {
            UCB0CTLW0 |= UCTXSTP;
        }
        while (!(UCB0IFG & UCRXIFG))
            ;
        array[i] = UCB0RXBUF;
    }

    return statusByte;
}

// creating UART for debugging since printing doesn't seem to work
void initUART()
{
    // configure uart pins, 1.4 = TX & 1.5 = RX
    P1SEL0 |= BIT4 | BIT5;
    //    P1SEL0 &= ~(BIT4 | BIT5);

    // configure uart for 9600 baud
    UCA0CTLW0 |= UCSWRST;       // eUSCI in reset
    UCA0CTLW0 |= UCSSEL__SMCLK; // choose smclk

    UCA0BR0 = 8;
    UCA0BR1 = 0x00;
    UCA0MCTLW = 0xD600;

    UCA0CTLW0 &= ~UCSWRST; // release from reset
}

void uart_write_char(char c)
{
    while (!(UCA0IFG & UCTXIFG)); // wait for tx buffer to be empty
    UCA0TXBUF = c;
}

void uart_write_string(const char *str)
{
    while (*str)
    {
        if (*str == '\n') {
            uart_write_char('\r');
        }
        uart_write_char(*str++);
    }
}

void uart_write_int(int num)
{
    char buf[10];
    int i = 0;
    if (num == 0)
    {
        uart_write_char('0');
        return;
    }
    while (num > 0 && i < 10)
    {
        buf[i++] = (num % 10) + '0';
        num /= 10;
    }
    while (--i >= 0)
    {
        uart_write_char(buf[i]);
    }
}

// Helper to set pins to a "High" state using internal pull-ups
void b_high(uint8_t pin) {
    P1DIR &= ~pin; // Set to input
    P1OUT |= pin;  // Ensure pull-up is active
}

// Helper to set pins to a "Low" state
void b_low(uint8_t pin) {
    P1OUT &= ~pin; // Write 0
    P1DIR |= pin;  // Set to output
}

void b_delay() { __delay_cycles(200); } // ~2.5kHz for maximum stability with weak pull-ups

void b_start() {
    b_high(SDA); b_high(SCL); b_delay();
    b_low(SDA); b_delay();
    b_low(SCL); b_delay();
}

void b_stop() {
    b_low(SDA); b_delay();
    b_high(SCL); b_delay();
    b_high(SDA); b_delay();
}

bool b_write(uint8_t data) {
    for (int i = 0; i < 8; i++) {
        if (data & 0x80) b_high(SDA);
        else b_low(SDA);
        b_delay();
        b_high(SCL); b_delay();
        b_low(SCL); b_delay();
        data <<= 1;
    }
    // Check for ACK
    b_high(SDA); b_delay();
    b_high(SCL); b_delay();
    bool ack = !(P1IN & SDA); // If SDA is pulled low, we have an ACK
    b_low(SCL); b_delay();
    return ack;
}

uint8_t runI2CScanner() {

    uart_write_string("Hardware Scan Starting...\r\n");
    for (uint8_t addr = 1; addr < 127; addr++) {
        UCB0I2CSA = addr;
        UCB0CTLW0 |= UCTR | UCTXSTT; // Start + Write

        uint32_t timeout = 5000;
        while ((UCB0CTLW0 & UCTXSTT) && --timeout); // Wait for Address

        if (timeout == 0) {
            // Bus is physically stuck - Reset the whole module
            UCB0CTLW0 |= UCSWRST;
            UCB0CTLW0 &= ~UCSWRST;
            continue;
        }

        if (!(UCB0IFG & UCNACKIFG)) { // SUCCESS: Device ACKed
            uart_write_string("Found i2c device at: ");
            uart_write_int(addr);
            uart_write_string("\r\n");

            // clean-up
            UCB0CTLW0 |= UCTXSTP;

